<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!--
        Copyright (C) 1997  Sun Microsystems, Inc
 *                    All rights reserved.
 *          Notice of copyright on this source code 
 *          product does not indicate publication. 
 * 
 * RESTRICTED RIGHTS LEGEND: Use, duplication, or disclosure by 
 * the U.S. Government is subject to restrictions as set forth 
 * in subparagraph (c)(1)(ii) of the Rights in Technical Data
 * and Computer Software Clause at DFARS 252.227-7013 (Oct. 1988) 
 * and FAR 52.227-19 (c) (June 1987).
 *
 *    Sun Microsystems, Inc., 2550 Garcia Avenue,
 *    Mountain View, California 94043.
 *
-->
<HTML>
<HEAD>
<TITLE>
Exercice 1 :  Cr&eacute;ation du projet Blink</TITLE>
</HEAD>
<BODY BGCOLOR="ffffff">

<h1>Exercice 1 :  Cr&eacute;ation du projet Blink</h1>

Cet exercice montre comment cr&eacute;er un projet appliquette, c'est-&agrave;-dire un programme Java
s'ex&eacute;cutant dans un navigateur Web.
Le projet que vous produirez, Blink, sera une petite appliquette ayant pour effet de faire clignoter
le texte dans diff&eacute;rentes couleurs. Vous cr&eacute;erez le projet &agrave; partir d'un fichier source existant,
<kbd>Blink.java</kbd>, lequel est install&eacute; dans votre r&eacute;pertoire <kbd>Blink</kbd>.
<ol>
<li>Cliquez sur le bouton Projets <img src="../../../../images/24/tb-project-manager_u.gif" align=MIDDLE><img src="../../images/spacer2_t.gif"> de la barre d'outils principale de Java
WorkShop.
<br>La fen&ecirc;tre Gestionnaire de projet s'affiche.

<li>V&eacute;rifiez dans le gestionnaire le nom du portfolio courant (identifi&eacute; par des caract&egrave;res
bleus).
<br>Si le portfolio courant n'est pas <code>personal</code>, double-cliquez sur le nom de votre
portfolio personnel.
Si vous n'en avez pas, reportez-vous &agrave; <nobr><a href="import.html">Ajout d'un
portfolio personnel</a>.</nobr>

<li>Choisissez <nobr>Fichier -&gt; Nouveau -&gt; Projet</nobr> (vous devez aller dans le menu
Fichier de la fen&ecirc;tre Gestionnaire de projet).
<br>L'assistant cr&eacute;ation de projet s'ouvre.

<li>S&eacute;lectionnez <kbd>untitled</kbd> et entrez <kbd>Blink</kbd> dans la zone de nom du projet.
<br>N'oubliez pas d'utiliser un "B" majuscule pour Blink. En effet, Java fait la distinction entre majuscules et minuscules. Le
nom de projet <kbd>Blink</kbd> concorde avec le nom du fichier source <kbd>Blink.java</kbd>, qui
est conforme &agrave; la convention Java de d&eacute;nomination avec majuscule en d&eacute;but de mot.
<li>Cliquez sur le bouton radio Appliquette pour d&eacute;signer le type d'application.
<li>Cliquez sur le bouton radio Pas d'interface.
<br>Ce projet ne comportera pas d'interface graphique utilisateur.

<li>Cliquez sur Suivant.

<li>Enregistrez le projet Blink dans le
r&eacute;pertoire par d&eacute;faut.

<li>Cliquez sur Oui pour ajouter au projet Blink des fichiers Java existants.
<li>Cliquez sur Suivant.

<li>Cliquez sur le bouton Ajouter tout dans r&eacute;pertoire (sous la liste Fichiers projet).
<br>Le nom de fichier <kbd>Blink.java</kbd> appara&icirc;t dans la liste Fichiers projet.

<li>Cliquez sur Suivant.
<br>Dans la zone Classe appliquette, Java Development Environment entre <kbd>Blink</kbd>. Le fichier de la
classe principale est le fichier <kbd>.class</kbd> qui &eacute;tend la classe <kbd>Applet</kbd> de la
biblioth&egrave;que Java.
<li>Cliquez sur Suivant.

<li>Utilisez la page HTML g&eacute;n&eacute;r&eacute;e par Java Development Environment.

<li>Cliquez sur Terminer.
<br>La fen&ecirc;tre de l'&eacute;diteur de source affiche le fichier source <code>Blink.java</code>, dont le
nom appara&icirc;t dans la barre de titre de Java Development Environment. Dans le gestionnaire de projet,
votre portfolio personnel indique Blink comme projet en cours. Le projet en cours d&eacute;finit
le contexte de tous les outils de Java Development Environment.
<p>
Dans cet exemple, vous avez cr&eacute;&eacute; le projet Blink dans le fichier
<kbd>Blink.prj</kbd> enregistr&eacute; dans votre r&eacute;pertoire <kbd>Blink</kbd>. A l'avenir, lorsque vous cr&eacute;erez un
projet, il pourra &ecirc;tre enregistr&eacute; dans n'importe quel r&eacute;pertoire de votre syst&egrave;me de
fichiers.
<p>
</ol>
<p>
<IMG SRC="../../images/hg_see.gif"><strong>Le&ccedil;on suivante :</strong>
<dl>
<dd><a href="build.html">Exercice 2 :  G&eacute;n&eacute;ration de projets</a>
</dl>
<p>
</BODY>
</HTML>
