<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!--
        Copyright (C) 1997  Sun Microsystems, Inc
 *                    All rights reserved.
 *          Notice of copyright on this source code 
 *          product does not indicate publication. 
 * 
 * RESTRICTED RIGHTS LEGEND: Use, duplication, or disclosure by 
 * the U.S. Government is subject to restrictions as set forth 
 * in subparagraph (c)(1)(ii) of the Rights in Technical Data
 * and Computer Software Clause at DFARS 252.227-7013 (Oct. 1988) 
 * and FAR 52.227-19 (c) (June 1987).
 *
 *    Sun Microsystems, Inc., 2550 Garcia Avenue,
 *    Mountain View, California 94043.
 *
-->
<HTML>
<HEAD>
<TITLE>
Concepts importants : Projets et portfolios
</TITLE>
</HEAD>
<BODY BGCOLOR="ffffff">

<h1>Concepts importants : Projets et portfolios</h1>

Les projets sont les &eacute;l&eacute;ments constitutifs de Java
WorkShop. Un projet organise les fichiers n&eacute;cessaires pour produire une appliquette, un programme
autonome, un module Java ou un bean. Il comprend &eacute;galement des informations le concernant, telles
que son nom et le fichier de sa classe principale.
<p>
Java Development Environment enregistre les informations relatives &agrave; chaque projet dans un fichier nomm&eacute;
<i>nomdeprojet</i><kbd>.prj</kbd>. Ce projet contient les fichiers source.
Java Development Environment cr&eacute;e le fichier en utilisant les informations que vous avez
donn&eacute;es lors de la cr&eacute;ation du projet, et notamment le nom du fichier et ceux
des fichiers source.
<p>
Apr&egrave;s avoir cr&eacute;&eacute; un projet, vous pouvez compl&eacute;ter et mettre &agrave; jour ses informations. Vous pouvez par exemple ajouter des informations sur la mani&egrave;re de disposer le projet sur une page
HTML, ou sur les options de compilateur &agrave; employer pour construire celui-ci.
Vous n'&eacute;diterez jamais directement le fichier <kbd>.prj</kbd>. Java Development Environment met &agrave; jour
ce fichier en fonction des actions que vous effectuez dans le gestionnaire de
projet.
<p>
Java Development Environment regroupe les projets dans un portfolio, de la m&ecirc;me mani&egrave;re que les fichiers sont
regroup&eacute;s dans un r&eacute;pertoire. En g&eacute;n&eacute;ral, chaque utilisateur d&eacute;tient un portfolio
<kbd>personnel</kbd> qui ne contient que les projets lui appartenant.
Lorsque vous d&eacute;marrez Java Development Environment pour la premi&egrave;re fois, votre portfolio personnel s'ouvre
automatiquement ; tout portfolio ouvert est appel&eacute; le <i>portfolio courant</i>.
<p>
Le projet s'affichant dans l'&eacute;diteur de source est appel&eacute; le <i>projet en cours</i>. Le projet en
cours d&eacute;finit le contexte de tous les outils de Java Development Environment. Quand vous utilisez les outils de
d&eacute;bogage, par exemple, ils affectent le projet en cours. <p>
Java Development Environment enregistre un portfolio dans un fichier nomm&eacute;
<i>nomdeportfolio</i><kbd>.psf</kbd>. Le fichier portfolio indique le chemin d'acc&egrave;s de chaque
fichier <kbd>.prj</kbd> relatif au portfolio.
<p>
<IMG SRC="../../images/hg_see.gif"><strong>Le&ccedil;on suivante :</strong>
<dl>
<dd><a href="create.html">Exercice 1 :  Cr&eacute;ation du projet Blink</a>
<p>
</BODY>
</HTML>
