<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!--
        Copyright (C) 1997  Sun Microsystems, Inc
 *                    All rights reserved.
 *          Notice of copyright on this source code 
 *          product does not indicate publication. 
 * 
 * RESTRICTED RIGHTS LEGEND: Use, duplication, or disclosure by 
 * the U.S. Government is subject to restrictions as set forth 
 * in subparagraph (c)(1)(ii) of the Rights in Technical Data
 * and Computer Software Clause at DFARS 252.227-7013 (Oct. 1988) 
 * and FAR 52.227-19 (c) (June 1987).
 *
 *    Sun Microsystems, Inc., 2550 Garcia Avenue,
 *    Mountain View, California 94043.
 *
-->
<HTML>
<HEAD>
<TITLE>
Exercice 2 : Mise &agrave; jour de la page d'ex&eacute;cution
</TITLE>
</HEAD>
<BODY BGCOLOR="ffffff">

<h1>Exercice 2 : Mise &agrave; jour de la page d'ex&eacute;cution</h1>

Dans cet exercice, vous ex&eacute;cuterez votre fichier HTML nouvellement cr&eacute;&eacute;, et non le fichier par
d&eacute;faut <kbd>Blink.tmp.html</kbd>.
<ol>
<li>V&eacute;rifiez dans le gestionnaire de projet le nom du projet en cours.
<br>Si le projet en cours n'est pas Blink, double-cliquez sur le nom de projet Blink.
<li>Choisissez <nobr>Projet -&gt; Editer.</nobr>
<br>La fen&ecirc;tre Edition de projet s'affiche.
<li>Cliquez sur l'onglet Ex&eacute;cution.
<li>Cliquez sur Oui pour URL de page d'ex&eacute;cution existant.
<br>Tous les champs de la fen&ecirc;tre deviennent gris&eacute;s, &agrave; l'exception de URL de page d'ex&eacute;cution
existant. Lorsque ce dernier est param&eacute;tr&eacute; sur Oui, Java
WorkShop ne tient pas compte des informations figurant dans l'onglet Ex&eacute;cution, lorsque le projet
est ex&eacute;cut&eacute;.
<li>Dans la zone URL de page d'ex&eacute;cution existant, saisissez le nouveau nom que vous venez de
donner &agrave; votre nouveau fichier HTML mis &agrave; jour.
<br>Il n'est pas n&eacute;cessaire de saisir le chemin d'acc&egrave;s complet.
Java Development Environment ira chercher le fichier dans le r&eacute;pertoire source.
<li>Cliquez sur OK.

<li>Cliquez sur le bouton Ex&eacute;cuter <img src="../../../../images/24/tb-run_u.gif" align=BOTTOM> de
la barre d'outils principale.
<br>Java Development Environment charge le nouveau fichier HTML dans l'explorateur.
Vous constaterez que le projet Blink s'ex&eacute;cute plus rapidement.
</ol>
<p>
<IMG SRC="../../images/hg_see.gif"><strong>Le&ccedil;on suivante :</strong>
<dl>
<dd>Vous avez effectu&eacute; tous les exercices de ce didacticiel.
Le didacticiel suivant s'intitule <a href="visual/visual.html">Didacticiel Sept : Cr&eacute;ation d'une interface</a>.
</dl>
<p>
</BODY>
</HTML>
