<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!--       
 *        Copyright (C) 1997  Sun Microsystems, Inc
 *                    All rights reserved.
 *          Notice of copyright on this source code 
 *          product does not indicate publication. 
 * 
 * RESTRICTED RIGHTS LEGEND: Use, duplication, or disclosure by 
 * the U.S. Government is subject to restrictions as set forth 
 * in subparagraph (c)(1)(ii) of the Rights in Technical Data
 * and Computer Software Clause at DFARS 252.227-7013 (Oct. 1988) 
 * and FAR 52.227-19 (c) (June 1987).
 *
 *    Sun Microsystems, Inc., 2550 Garcia Avenue,
 *    Mountain View, California 94043.
 *
-->
<HTML>
<HEAD>
<TITLE>
Exercice 4: Progression pas &agrave; pas dans une m&eacute;thode
</TITLE>
</HEAD>
<BODY BGCOLOR="ffffff">

<h1>Exercice 4: Progression pas &agrave; pas dans une m&eacute;thode</h1>

La progression pas &agrave; pas est aussi un moyen d'acc&eacute;der &agrave; la ligne probl&eacute;matique dans votre code. Cet
exercice vous montrera comment le faire, en suivant les modifications des valeurs des variables dans
la fen&ecirc;tre Threads/Pile. Vous apprendrez &eacute;galement comment supprimer un point d'arr&ecirc;t.
<ol>
<li>Cliquez sur le bouton Par-dessus<img src="../../../../images/24/db-step-over_u.gif" align="BOTTOM"><img src="../../images/spacer2_t.gif"> de
la barre d'outils Edition/D&eacute;bogage.
<br>Java Development Environment ex&eacute;cute une ligne du code source et s'arr&ecirc;te sur :
<p>
<kbd>If (Math.random() < 0.5) {</kbd>
<p>
L'&eacute;diteur de source met en surbrillance rouge la ligne o&ugrave; est situ&eacute; le point d'arr&ecirc;t, et verte celle
o&ugrave; l'ex&eacute;cution a &eacute;t&eacute; interrompue. S'il s'agissait d'un appel &agrave; une m&eacute;thode, la commande D&eacute;passer
sauterait &agrave; la ligne suivante du programme.  La commande Entrer dans, par contre, ex&eacute;cuterait la
premi&egrave;re instruction de la m&eacute;thode avant de s'arr&ecirc;ter.
<p>
La fen&ecirc;tre Threads/Pile signale l'&eacute;tat actuel du programme et de ses donn&eacute;es. 
<kbd>Blink.paint</kbd> indique, par exemple, qu'elle s'est interrompue &agrave; la ligne 49.
<li>Cliquez maintenant &agrave; deux reprises sur le bouton Par dessus pour observer comment le
d&eacute;bogueur progresse dans le programme.
<li>Dans l'&eacute;diteur de source, positionnez le pointeur sur la ligne 45, qui comporte un point
d'arr&ecirc;t.
<li>Clquez sur le bouton Point d'arr&ecirc;t <img src="../../../../images/24/db-stop-at_u.gif" align=MIDDLE> .
<br>
Java Development Environment supprime ce point d'arr&ecirc;t.
</ol>
<p>
<IMG SRC="../../images/hg_see.gif"><strong>Le&ccedil;on suivante :</strong>
<dl>
<dd><a href="evaluate.html">Exercice 5:  Evaluation de variables</a>
</dl>
<p>

</body>
</html>
