<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!--       
 *        Copyright (C) 1997  Sun Microsystems, Inc
 *                    All rights reserved.
 *          Notice of copyright on this source code 
 *          product does not indicate publication. 
 * 
 * RESTRICTED RIGHTS LEGEND: Use, duplication, or disclosure by 
 * the U.S. Government is subject to restrictions as set forth 
 * in subparagraph (c)(1)(ii) of the Rights in Technical Data
 * and Computer Software Clause at DFARS 252.227-7013 (Oct. 1988) 
 * and FAR 52.227-19 (c) (June 1987).
 *
 *    Sun Microsystems, Inc., 2550 Garcia Avenue,
 *    Mountain View, California 94043.
 *
-->
<HTML>
<HEAD>
<TITLE>
Exercice 3 : Recherche de cha&icirc;nes dans votre code
</TITLE>
</HEAD>
<BODY BGCOLOR="ffffff">

<h1>Exercice 3 : Recherche de cha&icirc;nes dans votre code</h1>

Dans cet exercice, vous apprendrez &agrave; trouver toutes les occurrences d'une cha&icirc;ne sp&eacute;cifi&eacute;e dans
votre code source. Vous pourrez alors visualiser ces occurrences dans le contexte de leur code
source.
<ol>
<li>V&eacute;rifiez dans le gestionnaire de projet le nom du projet en cours.
<br>Si celui-ci n'est pas Blink, double-cliquez sur le nom de projet Blink.
<li>Cliquez sur le bouton Chercher <img src="../../../../images/24/tb-string-search_u.gif" align=BOTTOM><img src="../../images/spacer2_t.gif">de la barre d'outils principale de Java
WorkShop.
<li>Saisissez <kbd>green</kbd> dans la zone Cha&icirc;ne.
<li>Cliquez sur Chercher.
<br>Les correspondances seront toutes les occurrences de cette cha&icirc;ne dans votre code source. Le
chercheur de cha&icirc;ne d&eacute;c&egrave;le deux correspondances de la cha&icirc;ne <kbd>green</kbd> et les affiche dans l'onglet Cha&icirc;ne de recherche en dessous de la
fen&ecirc;tre Editeur de source. Elles sont restitu&eacute;es sous la forme
<i>nomfichier:
num&eacute;ro_ligne</i>. Le code source qui contient la cha&icirc;ne est lui aussi affich&eacute;.
<li>Cliquez sur le lien de la premi&egrave;re correspondance, <kbd>Blink.java:32</kbd>.
<br>L'&eacute;diteur de source affiche la ligne source o&ugrave; figure la cha&icirc;ne. La ligne est surlign&eacute;e en
bleu.
<li>S&eacute;lectionnez <nobr>Parcourir -&gt; Correspondance suivante.</nobr>
<br>L'&eacute;diteur de source surligne le code contenant l'occurrence suivante.
</ol>
<p>
<IMG SRC="../../images/hg_see.gif"><strong>Le&ccedil;on suivante :</strong>
<dl>
<dd>Vous venez d'achever les le&ccedil;ons de ce didacticiel.  Le suivant s'intitule
<a href="simpledebug.html">Didacticiel Cinq :  D&eacute;bogage d'un projet</a>.
</dl>
<p>
</body>
</html>
