<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!--       
 *        Copyright (C) 1997  Sun Microsystems, Inc
 *                    All rights reserved.
 *          Notice of copyright on this source code 
 *          product does not indicate publication. 
 * 
 * RESTRICTED RIGHTS LEGEND: Use, duplication, or disclosure by 
 * the U.S. Government is subject to restrictions as set forth 
 * in subparagraph (c)(1)(ii) of the Rights in Technical Data
 * and Computer Software Clause at DFARS 252.227-7013 (Oct. 1988) 
 * and FAR 52.227-19 (c) (June 1987).
 *
 *    Sun Microsystems, Inc., 2550 Garcia Avenue,
 *    Mountain View, California 94043.
 *
-->
<HTML>
<HEAD>
<TITLE>
Outils de Java Development Environment
</TITLE>
</HEAD>
<BODY BGCOLOR="ffffff">

<h1>Outils de Java Development Environment</h1>

Les outils de Java Development Environment sont repr&eacute;sent&eacute;s par des boutons sur la barre d'outils principale
de Java Development Environment (situ&eacute;e sous la barre de menu).
<p>
Les boutons de la barre d'outils principale sont les suivants :
<dl>
<dt><img src="../../../../images/24/tb-build_u.gif" align=MIDDLE><img src="../../images/spacer2_t.gif"><strong>G&eacute;n&eacute;rer</strong>
<dd>G&eacute;n&egrave;re le projet en cours. Si votre projet comporte des erreurs, l'onglet G&eacute;n&eacute;rer les signale
ainsi que les liens avec le code source.
<dt><img src="../../../../images/24/tb-run_u.gif" align=MIDDLE><img src="../../images/spacer2_t.gif"><strong>Ex&eacute;cuter</strong>
<dd>Ex&eacute;cute le projet en cours. S'il s'agit d'une appliquette, un fichier HTML
est cr&eacute;&eacute; et ex&eacute;cut&eacute;
dans l'afficheur d'appliquette. S'il s'agit d'un programme autonome, ses r&eacute;sultats s'affichent
dans la console. Vous ne pouvez pas ex&eacute;cuter un module Java ou un bean.
<dt><img src="../../../../images/24/tb-profile_u.gif" align=MIDDLE><img src="../../images/spacer2_t.gif"><strong>Analyse
de performance</strong>
<dd>Lance l'analyseur de performance. Emet un rapport indiquant combien de temps a &eacute;t&eacute; consacr&eacute;
&agrave; chacune des m&eacute;thodes du programme et combien de fois chaque m&eacute;thode a &eacute;t&eacute; ex&eacute;cut&eacute;e.
<dt><img src="../../../../images/24/tb-string-search_u.gif" align=MIDDLE>
<img src="../../images/spacer2_t.gif"><strong>Chercher</strong>
<dd>Trouve les r&eacute;f&eacute;rences &agrave; des cha&icirc;nes de texte dans les fichiers source sp&eacute;cifi&eacute;s.
<dt><img src="../../../../images/24/tb-project-manager_u.gif" align=MIDDLE>
<img src="../../images/spacer2_t.gif"><strong>Projets</strong>
<dd>G&eacute;n&egrave;re, importe, &eacute;dite et supprime des projets.
<p>Les projets sont la pierre angulaire de Java Development Environment. Un projet assure le
suivi des divers fichiers requis pour g&eacute;n&eacute;rer, parcourir, ex&eacute;cuter et d&eacute;boguer un projet dans Java
WorkShop. Les projets sont regroup&eacute;s en portfolios. Java Development Environment g&egrave;re les
types de projet suivants :
<ul>
<li><strong>Appliquette.</strong> Programme &eacute;crit dans le langage Java et s'ex&eacute;cutant dans un
explorateur compatible Java, tel que HotJava.
<li><strong>Programme autonome.</strong> Programme &eacute;crit dans le langage Java et s'ex&eacute;cutant &agrave; l'ext&eacute;rieur d'un navigateur Web, g&eacute;n&eacute;ralement &agrave; partir d'une fen&ecirc;tre de commande MS-DOS ou d'un
utilitaire Shell sous l'environnement d'exploitation UNIX.
<li><strong>Module Java.</strong> Groupe de classes Java d&eacute;clar&eacute;es avec le m&ecirc;me nom de module.
<li><strong>Java beans.</strong> Composants logiciels r&eacute;utilisables pouvant &ecirc;tre manipul&eacute;s dans le
g&eacute;n&eacute;rateur GUI.
</ul>

<dt><img src="../../../../images/24/vj_attributes_up.gif" align=MIDDLE><img src="../../images/spacer2_t.gif"><strong>Attributs</strong>
<dd>Permet d'&eacute;diter les propri&eacute;t&eacute;s des composants de l'interface des projets du
g&eacute;n&eacute;rateur GUI.
<dt><img src="../../../../images/24/tb-help_u.gif" align=MIDDLE><img src="../../images/spacer2_t.gif"><strong>Aide</strong>
<dd>Fournit des informations sur Java Development Environment. Vous pouvez obtenir des informations de diff&eacute;rentes mani&egrave;res :
<ul>
<li>en cliquant sur le bouton Aide (repr&eacute;sent&eacute; par le point d'interrogation) de la barre d'outils
principale de Java Development Environment, pour obtenir des informations sur les divers boutons de cette barre
d'outils ;
<li>en cliquant sur le bouton Aide (repr&eacute;sent&eacute; par le point d'interrogation) de
la barre d'outils Editer/D&eacute;boguer, pour obtenir des informations sur les divers boutons de
celle-ci ;
<li>dans le menu Aide, en s&eacute;lectionnant la rubrique voulue ;
<li>en cliquant sur le bouton Aide dans une bo&icirc;te de dialogue ou un onglet.
</ul>
<p>
Si vous voulez v&eacute;rifier l'action r&eacute;alis&eacute;e par un bouton, vous
pouvez afficher sa description
en pla&ccedil;ant le pointeur dessus. Elle appara&icirc;tra au bas de la page du navigateur.
</dl>

<p>
<IMG SRC="../../images/hg_see.gif"><strong>Voir aussi : </strong>
<dl>
<dd><a href="flow.html">Etapes de d&eacute;veloppement de projet</a>
<dd><a href="terminology.html">Terminologie de Java Development Environment </a>

<p>
</BODY>
</HTML>
