<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!--
        Copyright (C) 1997  Sun Microsystems, Inc
 *                    All rights reserved.
 *          Notice of copyright on this source code 
 *          product does not indicate publication. 
 * 
 * RESTRICTED RIGHTS LEGEND: Use, duplication, or disclosure by 
 * the U.S. Government is subject to restrictions as set forth 
 * in subparagraph (c)(1)(ii) of the Rights in Technical Data
 * and Computer Software Clause at DFARS 252.227-7013 (Oct. 1988) 
 * and FAR 52.227-19 (c) (June 1987).
 *
 *    Sun Microsystems, Inc., 2550 Garcia Avenue,
 *    Mountain View, California 94043.
 *
-->
<HTML>
<HEAD>
<TITLE>
&Ouml;vning 1:  Skapa Blink-projektet
</TITLE>
</HEAD>
<BODY BGCOLOR="ffffff">

<h1>&Ouml;vning 1:  Skapa Blink-projektet</h1>

Den h&auml;r &ouml;vningen visar hur du skapar ett miniprogramprojekt, ett
Java-program som utformas f&ouml;r att k&ouml;ras i en webbl&auml;sare. Projektet
som du skapar, Blink, &auml;r ett litet miniprogram som visar blinkande text i
olika f&auml;rger. Du skapar projektet med en befintlig k&auml;llfil,
<kbd>Blink.java</kbd>, som har installerats i katalogen <kbd>Blink</kbd>.
<ol>
<li>Klicka p&aring; projektknappen <img src="../../../../images/24/tb-project-manager_u.gif" align=MIDDLE><img src="../../images/spacer2_t.gif"> i verktygsf&auml;ltet i Java Development Environments huvudf&ouml;nster.
<br>D&aring; visas f&ouml;nstret Projekthanteraren.
<li>Leta efter namnet p&aring; den aktuella portfolio-filen i
projekthanteraren. Den aktuella filen visas med bl&aring; text.
<br>Om den aktuella portfolio-filen inte &auml;r <code>personlig</code>
dubbelklickar du p&aring; det personliga portfolionamnet. Om du
inte har n&aring;gon egen portfolio finns det mer information i <nobr><a href="import.html">L&auml;gga till
dinpersonliga portfolio</a>.</nobr>

<li>V&auml;lj <nobr>Arkiv -&gt; Nytt -&gt; Projekt</nobr> (var noga med
att g&aring; till Arkiv-menyn i projekthanteraren).
<br>S&aring; &ouml;ppnas guiden Skapa projekt.

<li>Markera <kbd>namnl&ouml;s</kbd> och skriv <kbd>Blink</kbd> i rutan f&ouml;r
projektnamnet.
<br>Var noga med att skriva ett versalt "B" i Blink. Java &auml;r
skriftl&auml;gesk&auml;nsligt. Projektnamnet <kbd>Blink</kbd> &ouml;verensst&auml;mmer
med namnet p&aring; k&auml;llfilen, <kbd>Blink.java</kbd>, som f&ouml;ljer Java-reglerna f&ouml;r initial versal.
<li>Klicka p&aring; alternativknappen Miniprogram som motsvarar typen av till&auml;mpning.
<li>Klicka p&aring; envals knappen Inget GUI.
<br>Det h&auml;r projektet kommer inte att ha n&aring;got grafiskt anv&auml;ndargr&auml;nssnitt.
<li>Klicka p&aring; N&auml;sta.
<li>Du b&ouml;r spara Blink-projektet i standardkatalogen.
<li>Klicka p&aring; Ja f&ouml;r att l&auml;gga till de befintliga Java-filerna i Blink-projektet.
<li>Klicka p&aring; N&auml;sta.
<li>Klicka p&aring; knappen L&auml;gg till alla i katalogen (under listan
med projektfiler).
<br>Filnamnet <kbd>Blink.java</kbd> visas i listan med projektfiler.
<li>Klicka p&aring; N&auml;sta.
<br>Ordet <kbd>Blink</kbd> infogas automatiskt i rutan
Miniprogramklass. Huvudklassfilen &auml;r filen <kbd>.class</kbd> som
ut&ouml;kar klassen <kbd>Applet</kbd> i Java-biblioteket.
<li>Klicka p&aring; N&auml;sta.
<li>Du b&ouml;r anv&auml;nda html-sidan som genereras av Java Development Environment.
<li>Klicka p&aring; Klar.
<br>K&auml;llfilen <code>Blink.java</code> visas i k&auml;llredigeraren och
filens namn visas i titelraden i Java Development Environment. I projekthanteraren
visar den egna portfolio-filen Blink-projektet som det aktuella
projektet. Det aktuella projektet anger sammanhanget f&ouml;r alla verktygen i Java Development Environment.
<p>
I det h&auml;r exemplet skapade du Blink-projektet i filen
<kbd>Blink.prj</kbd> i katalogen <kbd>Blink</kbd>. N&auml;r du skapar
projekt i framtiden kan du skapa det i vilken katalog som helst i filsystemet.
<p>
</ol>
<p>
<IMG SRC="../../images/hg_see.gif"><strong>N&auml;sta lektion:</strong>
<dl>
<dd><a href="build.html">&Ouml;vning 2: Bygga projektet</a>
</dl>
<p>
</BODY>
</HTML>
