<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!--       
 *        Copyright (C) 1997  Sun Microsystems, Inc
 *                    All rights reserved.
 *          Notice of copyright on this source code 
 *          product does not indicate publication. 
 * 
 * RESTRICTED RIGHTS LEGEND: Use, duplication, or disclosure by 
 * the U.S. Government is subject to restrictions as set forth 
 * in subparagraph (c)(1)(ii) of the Rights in Technical Data
 * and Computer Software Clause at DFARS 252.227-7013 (Oct. 1988) 
 * and FAR 52.227-19 (c) (June 1987).
 *
 *    Sun Microsystems, Inc., 2550 Garcia Avenue,
 *    Mountain View, California 94043.
 *
-->
<HTML>
<HEAD>
<TITLE>
Verktyg i Java Development Environment
</TITLE>
</HEAD>
<BODY BGCOLOR="ffffff">

<h1>Verktyg i Java Development Environment</h1>

Verktygen i Java Development Environment motsvaras av knappar i huvudverktygsf&auml;ltet
i Java Development Environment (under menyraden).
<p>
Huvudverktygsf&auml;ltet inneh&aring;ller f&ouml;ljande knappar:
<dl>
<dt><img src="../../../../images/24/tb-build_u.gif" align=MIDDLE><img src="../../images/spacer2_t.gif"><strong>Bygg</strong>
<dd>Bygger det aktuella projektet. Om projektet inneh&aring;ller fel visas
felen p&aring; fliken Bygg, som ocks&aring; inneh&aring;ller l&auml;nkar till k&auml;llkoden.

<dt><img src="../../../../images/24/tb-run_u.gif" align=MIDDLE><img src="../../images/spacer2_t.gif"><strong>K&ouml;r</strong>
<dd>K&ouml;r det aktuella projektet. Om projektet &auml;r ett miniprogram
skapas en HTML-fil som k&ouml;rs i miniprogramgranskaren. Om projektet &auml;r
ett frist&aring;ende program visas utmatningen i systemf&ouml;nstret. Du kan
inte k&ouml;ra Java-paket eller b&ouml;nor.
<dt><img src="../../../../images/24/tb-profile_u.gif" align=MIDDLE><img src="../../images/spacer2_t.gif"><strong>Profil</strong>
<dd>K&ouml;r profileraren. Skapar en rapport som visar hur mycket tid som
anv&auml;nds i varje programmetod och hur m&aring;nga g&aring;nger varje metod exekveras.
<dt><img src="../../../../images/24/tb-string-search_u.gif" align=MIDDLE>
<img src="../../images/spacer2_t.gif"><strong>S&ouml;k</strong>
<dd>S&ouml;ker efter referenser till textstr&auml;ngar i angivna k&auml;llfiler.
<dt><img src="../../../../images/24/tb-project-manager_u.gif" align=MIDDLE>
<img src="../../images/spacer2_t.gif"><strong>Projekt</strong>
<dd>Skapar, importerar, redigerar och tar bort projekt.
<p>Projekten &auml;r h&ouml;rnstenarna i Java Development Environment. De h&aring;ller reda p&aring; de
olika filer som beh&ouml;vs f&ouml;r att bygga, granska, k&ouml;ra och fels&ouml;ka
projekt i Java Development Environment. Projekten grupperas i portfolio-filer. F&ouml;ljande
typer av projekt &auml;r tillg&auml;ngliga i Java Development Environment:
<ul>
<li><strong>Miniprogram.</strong> Ett program som har skrivits p&aring;
spr&aring;ket Java och k&ouml;rs i en webbl&auml;sare som kan hantera Java,
exempelvis HotJava.
<li><strong>Frist&aring;ende program.</strong> Ett program som har
skrivits p&aring; spr&aring;ket Java och k&ouml;rs utanf&ouml;r en webbl&auml;sare, vanligtvis
fr&aring;n ett MS-DOS-f&ouml;nster eller skalverktyg i operativmilj&ouml;n UNIX.
<li><strong>Java-paket.</strong> En grupp Java-klasser som har
deklarerats med samma paketnamn.
<li><strong>Java-b&ouml;nor.</strong> &Aring;teranv&auml;ndbara
programvarukomponenter som kan manipuleras i GUI-byggaren.
</ul>

<dt><img src="../../../../images/24/vj_attributes_up.gif" align=MIDDLE><img src="../../images/spacer2_t.gif"><strong>Attribut</strong>
<dd>Redigerar egenskaper hos gr&auml;nssnittskomponenterna i GUI-byggarprojekt.
<dt><img src="../../../../images/24/tb-help_u.gif" align=MIDDLE><img src="../../images/spacer2_t.gif"><strong>Hj&auml;lp</strong>
<dd>Ger information om Java Development Environment. Du kan f&aring; hj&auml;lp p&aring; flera olika s&auml;tt:
<ul>
<li>Klicka p&aring; knappen Hj&auml;lp (fr&aring;getecknet) i huvudverktygsf&auml;ltet
i Java Development Environment om du vill f&aring; information om verktygsknapparna.
<li>Klicka p&aring; knappen Hj&auml;lp (fr&aring;getecknet) i verktygsf&auml;ltet f&ouml;r
redigering och fels&ouml;kning om du vill f&aring; information om
verktygknapparna i detta verktygsf&auml;lt.
<li>V&auml;lj det element som du vill ha hj&auml;lp om p&aring; Hj&auml;lp-menyn.
<li>Klicka p&aring; knappen Hj&auml;lp i en dialoguta eller p&aring; en flik.
</ul>
<p>
Om du inte &auml;r s&auml;ker p&aring; vilken &aring;tg&auml;rd en viss knapp utf&ouml;r, kan du
f&aring; en beskrivning av knappen genom att placera pekaren p&aring; den. Beskrivningen
visas i fottexten i webbl&auml;saren.
</dl>

<p>
<IMG SRC="../../images/hg_see.gif"><strong>Se &auml;ven:</strong>
<dl>
<dd><a href="flow.html">Stadier i projektutveckling </a>
<dd><a href="terminology.html">Begrepp i Java Development Environment</a>

<p>
</BODY>
</HTML>
