<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!--
        Copyright (C) 1997  Sun Microsystems, Inc
 *                    All rights reserved.
 *          Notice of copyright on this source code 
 *          product does not indicate publication. 
 * 
 * RESTRICTED RIGHTS LEGEND: Use, duplication, or disclosure by 
 * the U.S. Government is subject to restrictions as set forth 
 * in subparagraph (c)(1)(ii) of the Rights in Technical Data
 * and Computer Software Clause at DFARS 252.227-7013 (Oct. 1988) 
 * and FAR 52.227-19 (c) (June 1987).
 *
 *    Sun Microsystems, Inc., 2550 Garcia Avenue,
 *    Mountain View, California 94043.
 *
-->
<HTML>
<HEAD>
<TITLE>
Viktiga begrepp: Projekt och Portfolios
</TITLE>
</HEAD>
<BODY BGCOLOR="ffffff">

<h1>Viktiga begrepp: Projekt och Portfolios</h1>

Projekten &auml;r de grundl&auml;ggande byggstenarna i Java Development Environment. Ett projekt organiserar de filer som
kr&auml;vs f&ouml;r att producera ett miniprogram, ett frist&aring;ende program,
ett Javapaket eller en b&ouml;na. Ett projekt innefattar ocks&aring; information om sig sj&auml;lvt, t.ex.
projektets namn och huvudklassfil.
<p>
Java Development Environment lagrar projektinformation i en fil som ben&auml;mns
<i>projektnamn</i><kbd>.prj</kbd>. Detta projekt lagrar k&auml;llfilerna. Java Development Environment skapar filen
genom att anv&auml;nda projektnamnet, k&auml;llfilens namn och &ouml;vrig information du ger n&auml;r du skapar
projektet.
<p>
N&auml;r du har skapat projektet kan du l&auml;gga till och uppdatera dess information. Du kan t.ex. l&auml;gga
till information om hur projektet ska visas p&aring; en HTML-sida, eller vilka kompileringsalternativ
som ska anv&auml;ndas vid uppbyggnaden av projektet. Du redigerar aldrig direkt i filen <kbd>.prj</kbd>. Java
WorkShop uppdaterar filen baserat p&aring; de &aring;tg&auml;rder du utf&ouml;r via Projekthanteraren.
<p>
Java Development Environment grupperar projekten tillsammans i en portfolio, p&aring; samma s&auml;tt som filer grupperas i
kataloger. Oftast har varje anv&auml;ndare en <kbd>personlig</kbd> portfolio, som bara inneh&aring;ller de
projekt som tillh&ouml;r henne/honom. N&auml;r du startar Java Development Environment f&ouml;r f&ouml;rsta g&aring;ngen befinner du dig
"inuti" din
personliga portfolio-den portfolio som du &auml;r "inuti" kallas f&ouml;r din <i>aktuella
portfolio</i>.
<p>
Projektet som visas i k&auml;llredigeraren kallas <i>aktuellt projekt</i>. Det aktuella
projektet st&auml;ller in kontexten f&ouml;r alla verktyg i Java Development Environment. N&auml;r du t.ex. anv&auml;nder
fels&ouml;kningsfunktioner fels&ouml;ks aktuellt projekt.
<p>
Java Development Environment lagrar en portfolio i en fil som kallas <i>portfolionamn</i><kbd>.psf</kbd>. Portfoliofilen
listar s&ouml;kv&auml;gsnamnet f&ouml;r varje <kbd>.prj</kbd>-fil, relativt portfolion.
<p>
<IMG SRC="../../images/hg_see.gif"><strong>N&auml;sta lektion:</strong>
<dl>
<dd><a href="create.html">&Ouml;vning 1:  Skapa projektet Blink</a>
<p>
</BODY>
</HTML>
