<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!--       
 *        Copyright (C) 1997  Sun Microsystems, Inc
 *                    All rights reserved.
 *          Notice of copyright on this source code 
 *          product does not indicate publication. 
 * 
 * RESTRICTED RIGHTS LEGEND: Use, duplication, or disclosure by 
 * the U.S. Government is subject to restrictions as set forth 
 * in subparagraph (c)(1)(ii) of the Rights in Technical Data
 * and Computer Software Clause at DFARS 252.227-7013 (Oct. 1988) 
 * and FAR 52.227-19 (c) (June 1987).
 *
 *    Sun Microsystems, Inc., 2550 Garcia Avenue,
 *    Mountain View, California 94043.
 *
-->
<HTML>
<HEAD>
<TITLE>
Java Development Environment Sj&auml;lvstudier
</TITLE>
</HEAD>
<BODY BGCOLOR="ffffff">

<H1>Java Development Environment Sj&auml;lvstudier</h1>

Syftet med sj&auml;lvstudierna &auml;r att visa hur du kan anv&auml;nda de
grundl&auml;ggandee funktionerna i Java Development Environment f&ouml;r att skapa,
redigera, bygga, fels&ouml;ka och k&ouml;ra projekt.
<p>
I det f&ouml;rsta avsnittet f&aring;r du bekanta dig med begreppen, verktygen och
utvecklingsproceduren som anv&auml;nds i Java Development Environment. En beskrivning av
de grundl&auml;ggandee funktionerna i Java Development Environment finns i sj&auml;lvstudierna
1-5. I avsnitten 6 och 7 beskrivs avancerade funktioner i Java Development Environment.
<ul>
<li><a href="overview.html">Introduktion tilll Java Development Environment</a>
tar upp hur du kan anv&auml;nda Java Development Environment f&ouml;r att skapa
Internet-till&auml;mpningar och webbsidor.
<li><a href="quickstart.html">Sj&auml;lvstudie ett: Skapa Blink-projektet</a> visar hur du skapar, bygger och k&ouml;r miniprogram i Java Development Environment.
<li><a href="edit.html">Sj&auml;lvstudie tv&aring;: Redigera
projektattribut</a> g&aring;r igenom hur du redigerar projektet.
<li><a href="errors.html">Sj&auml;lvstudie tre: &Aring;tg&auml;rda fel i k&auml;llkod</a> beskriver hur du r&auml;ttar fel n&auml;r du bygger projektet, och hur
du bygger om dina projekt.
<li><a href="browse.html">Sj&auml;lvstudie fyra: Bl&auml;ddra igenom ett
projekt</a> visar hur du g&aring;r igenom klasserna och metoderna som utg&ouml;r projektet. H&auml;r
f&aring;r du ocks&aring; l&auml;ra dig att s&ouml;ka efter str&auml;ngar i k&auml;llkoden.
<li><a href="simpledebug.html">Sj&auml;lvstudie fem: Fels&ouml;ka ett projekt</a> f&ouml;rklarar hur du letar upp och korrigerar fel som g&ouml;r att
projektet inte k&ouml;rs korrekt. H&auml;r anv&auml;nder du fels&ouml;karen f&ouml;r att
granska tr&aring;dar, ange brytpunkter och utv&auml;rdera uttryck.
<li><a href="customize.html">Sj&auml;lvstudie sex: Anpassa en k&ouml;rsida</a> beskriver hur du redigerar HTML-filen som Java
WorkShop skapar &aring;t dig n&auml;r du k&ouml;r ett projekt.
<li><a href="visual/visual.html">Sj&auml;lvstudie sju: Skapa ett GUI</a> tar upp hur du skapar ett anv&auml;ndargr&auml;nssnitt till ett projekt.
<li><a href="clock/BeansOverview.html">Sj&auml;lvstudie &aring;tta: Skapa
Clock-projektet</a> handlar om hur du skapar ett b&ouml;nprojekt och
importerar JavaBeans till GUI-byggaren.
</ul>
<p>
</BODY>
</HTML>
