<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!--
        Copyright (C) 1997  Sun Microsystems, Inc
 *                    All rights reserved.
 *          Notice of copyright on this source code 
 *          product does not indicate publication. 
 * 
 * RESTRICTED RIGHTS LEGEND: Use, duplication, or disclosure by 
 * the U.S. Government is subject to restrictions as set forth 
 * in subparagraph (c)(1)(ii) of the Rights in Technical Data
 * and Computer Software Clause at DFARS 252.227-7013 (Oct. 1988) 
 * and FAR 52.227-19 (c) (June 1987).
 *
 *    Sun Microsystems, Inc., 2550 Garcia Avenue,
 *    Mountain View, California 94043.
 *
-->
<HTML>
<HEAD>
<TITLE>
Ejercicio 1:  Creaci&oacute;n del proyecto Blink
</TITLE>
</HEAD>
<BODY BGCOLOR="ffffff">

<h1>Ejercicio 1:  Creaci&oacute;n del proyecto Blink</h1>

Este ejercicio le muestra c&oacute;mo crear un proyecto applet: un
programa Java dise&ntilde;ado para su ejecuci&oacute;n dentro de un examinador de Web. El
proyecto que crear&aacute;, Blink, es una peque&ntilde;a aplicaci&oacute;n que
muestra intermitentemente un texto, en diferentes colores. El
proyecto se crea utilizando un archivo fuente existente,
<kbd>Blink.java</kbd>, que se instal&oacute; en el directorio
<kbd>Blink.</kbd> 
<ol>
<li>Pulse en el bot&oacute;n "Proyectos" <img
src="../../../../images/24/tb-project-manager_u.gif" align=MIDDLE><img
src="../../images/spacer2_t.gif"> en la barra de herramientas
principal de Java Development Environment.
<br>Aparece la ventana del Administrador de proyectos de Java
WorkShop. 
<li>Compruebe en el administrador de proyectos el nombre de la
cartera actual, que aparece en texto azul.
<br>Si la cartera actual no es <code>personal</code>,
pulse dos veces en en el nombre de la cartera. Si no tiene una cartera
personal, v&eacute;ase <nobr><a href="import.html">Adici&oacute;n de una cartera
personal</a>.</nobr>

<li>Seleccione <nobr>"Archivo
-&gt; Nuevo -&gt; Proyecto"</nobr> (aseg&uacute;rese de ir al men&uacute; "Archivo" en
la ventana del administrador del proyecto).
<br>Se abre la ventana del asistente de creaci&oacute;n de proyectos.
<li>Seleccione <kbd>sin t&iacute;tulo</kbd> y escriba <kbd>Blink</kbd> en el cuadro de
nombre del proyecto.
<br>Aseg&uacute;rese de escribir la primera letra de Blink en
may&uacute;scula. Java distingue entre may&uacute;sculas y min&uacute;sculas. El nombre del proyecto
<kbd>Blink</kbd> es coherente con el nombre del archivo fuente
<kbd>Blink.java</kbd>, que sigue la convenci&oacute;n de Java en
cuanto a las may&uacute;sculas iniciales.
<li>Pulse en el bot&oacute;n de radio "Applet" correspondiente al tipo de
aplicaci&oacute;n.
<li>Pulse en el bot&oacute;n de radio "Ninguna GUI".
<br>Este proyecto no tendr&aacute; ninguna interfaz gr&aacute;fica de usuario.
<li>Pulse en "Siguiente".
<li>Debe guardar el proyecto Blink en el directorio predeterminado.
<li>Pulse en "S&iacute;" y a&ntilde;ada los archivos Java existentes al proyecto Blink.
<li>Pulse en "Siguiente".
<li>Pulse en el bot&oacute;n "A&ntilde;adir todo en directorio" (debajo de la
lista de archivos del proyecto).
<br>El nombre de archivo <kbd>Blink.java</kbd> aparece en la
lista "Archivos del proyecto".
<li>Pulse en "Siguiente".
<br>En el cuadro "Clase de applet", Java Development Environment introduce <kbd>Blink</kbd>. El
archivo de clase main es el archivo <kbd>.class</kbd> que ampl&iacute;a la
clase <kbd>Applet</kbd> de la biblioteca Java.
<li>Pulse en "Siguiente".
<li>Debe utilizar la p&aacute;gina html generada por Java Development Environment.
<li>Pulse en "Finalizar".
<br>La ventana del editor de c&oacute;digo fuente muestra el archivo fuente
<code>Blink.java</code> con su nombre en la barra de t&iacute;tulo de
Java Development Environment. En el administrador de proyectos, su cartera personal
muestra el proyecto Blink como proyecto actual. El proyecto
actual define el contexto de todas las herramientas de Java Development Environment. <p>
En este ejemplo, ha creado el proyecto Blink en el archivo
<kbd>Blink.prj</kbd> en el directorio <kbd>Blink.</kbd>  Cuando
cree un proyecto en el futuro, puede crearlo en cualquier directorio
del sistema de archivos.
<p>
</ol>
<p>
<IMG SRC="../../images/hg_see.gif"><strong>Siguiente lecci&oacute;n:</strong>
<dl>
<dd><a href="build.html">Ejercicio 2:  Construcci&oacute;n del proyecto</a>
</dl>
<p>
</BODY>
</HTML>
