<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!--
        Copyright (C) 1997  Sun Microsystems, Inc
 *                    All rights reserved.
 *          Notice of copyright on this source code 
 *          product does not indicate publication. 
 * 
 * RESTRICTED RIGHTS LEGEND: Use, duplication, or disclosure by 
 * the U.S. Government is subject to restrictions as set forth 
 * in subparagraph (c)(1)(ii) of the Rights in Technical Data
 * and Computer Software Clause at DFARS 252.227-7013 (Oct. 1988) 
 * and FAR 52.227-19 (c) (June 1987).
 *
 *    Sun Microsystems, Inc., 2550 Garcia Avenue,
 *    Mountain View, California 94043.
 *
-->
<HTML>
<HEAD>
<TITLE>
Conceptos importantes: Proyectos y carteras
</TITLE>
</HEAD>
<BODY BGCOLOR="ffffff">

<h1>Conceptos importantes: Proyectos y carteras</h1>

Los proyectos son los bloques de construcci&oacute;n b&aacute;sicos de
Java Development Environment. Los proyectos organizan los archivos necesarios para
producir applets, programas aut&oacute;nomos, paquetes Java o
beans. Los proyectos incluyen tambi&eacute;n informaci&oacute;n sobre s&iacute; mismos, como
el nombre de proyecto y el archivo de clase main.
<p>
Java Development Environment almacena la informaci&oacute;n del proyecto en un archivo
llamado <i>nombre-proyecto</i><kbd>.prj</kbd>. Este proyecto almacena los
archivos fuente. Java Development Environment crea el archivo utilizando el nombre
de proyecto, los nombres de archivos fuente, y la restante informaci&oacute;n que
proporciona el usuario al crear el proyecto.
<p>
Una vez creado un proyecto, podr&aacute; a&ntilde;adir y actualizar su
informaci&oacute;n. Por ejemplo, podr&iacute;a a&ntilde;adir informaci&oacute;n sobre la forma en
que se visualizar&aacute; el proyecto en una p&aacute;gina HTML, o las opciones del
compilador que se utilizar&aacute;n para crear el proyecto. No deber&aacute; editar
nunca directamente el archivo <kbd>.prj</kbd>. Java Development Environment
actualizar&aacute; el archivo bas&aacute;ndose en las acciones que se lleven a cabo
con el administrador de proyectos.
<p>
Java Development Environment almacena todos los proyectos en carteras, del mismo
modo que los archivos se almacenan en directorios. Por lo general, cada
usuario tiene una cartera <kbd>personal</kbd>, que contiene s&oacute;lo los
proyectos que son suyos. Cuando se inicia Java
WorkShop por primera vez, el usuario estar&aacute; "dentro" de su cartera
personal: la cartera en la que el usuario se encuentra recibe el nombre
de <i>cartera personal</i>.
<p>
El proyecto que se visualiza en el editor de c&oacute;digo fuente recibe el
nombre de <i>proyecto actual</i>. El proyecto actual define el contexto para
todas las herramientas de Java Development Environment. Por ejemplo, si se
utilizan las herramientas de depuraci&oacute;n, estas afectar&aacute;n al proyecto actual.
<p>
Java Development Environment almacena las carteras en un archivo llamado
<i>nombre-cartera</i><kbd>.psf</kbd>. El
archivo de la cartera muestra una lista con el nombre de ruta de
todos los archivos <kbd>.prj</kbd> relativos a la cartera.
<p>
<IMG SRC="../../images/hg_see.gif"><strong>Lecci&oacute;n siguiente:</strong>
<dl>
<dd><a href="create.html">Ejercicio 1:  Creaci&oacute;n del proyecto Blink</a>
<p>
</BODY>
</HTML>
