<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!--       
 *        Copyright (C) 1997  Sun Microsystems, Inc
 *                    All rights reserved.
 *          Notice of copyright on this source code 
 *          product does not indicate publication. 
 * 
 * RESTRICTED RIGHTS LEGEND: Use, duplication, or disclosure by 
 * the U.S. Government is subject to restrictions as set forth 
 * in subparagraph (c)(1)(ii) of the Rights in Technical Data
 * and Computer Software Clause at DFARS 252.227-7013 (Oct. 1988) 
 * and FAR 52.227-19 (c) (June 1987).
 *
 *    Sun Microsystems, Inc., 2550 Garcia Avenue,
 *    Mountain View, California 94043.
 *
-->
<HTML>
<HEAD>
<TITLE>
Herramientas de Java Development Environment
</TITLE>
</HEAD>
<BODY BGCOLOR="ffffff">

<h1>Herramientas de Java Development Environment</h1>

La herramientas de Java Development Environment est&aacute;n representadas por botones
en la barra de herramientas principal de Java Development Environment (debajo
de la barra de men&uacute;s).
<p>
Los botones de la barra de herramientas principal son:
<dl>
<dt><img src="../../../../images/24/tb-build_u.gif" align=MIDDLE><img
src="../../images/spacer2_t.gif"><strong>Construir</strong>
<dd>Construye el proyecto actual. Si el proyecto contiene errores, la
pesta&ntilde;a "Construir" informa de los errores y enlaces con el c&oacute;digo fuente.
<dt><img src="../../../../images/24/tb-run_u.gif" align=MIDDLE><img
src="../../images/spacer2_t.gif"><strong>Ejecutar</strong>
<dd>Ejecuta el proyecto actual. Si el proyecto es un applet, se crea
un archivo HTML y se ejecuta en el visualizador de applets. Si el
proyecto es un programa aut&oacute;nomo, la salida va a la consola. No puede
ejecutar un paquete Java ni un bean.
<dt><img src="../../../../images/24/tb-profile_u.gif" align=MIDDLE><img
src="../../images/spacer2_t.gif"><strong>Perfil</strong>
<dd>Ejecuta el Perfilador. Produce un informe que muestra cu&aacute;nto
tiempo se ha dedicado a cada m&eacute;todo del programa y cu&aacute;ntas veces se
ejecuta cada m&eacute;todo.
<dt><img src="../../../../images/24/tb-string-search_u.gif" align=MIDDLE>
<img src="../../images/spacer2_t.gif"><strong>Buscar</strong>
<dd>Busca referencias a cadenas de texto en archivos de c&oacute;digo fuente
especificados.
<dt><img src="../../../../images/24/tb-project-manager_u.gif" align=MIDDLE>
<img src="../../images/spacer2_t.gif"><strong>Proyectos</strong>
<dd>Crea, importa, edita y suprime proyectos.
<p>Los proyectos son la piedra angular de Java Development Environment. Un
proyecto hace el seguimiento de los diversos archivos necesarios para
construir, examinar, ejecutar y depurar un proyecto en Java Development Environment. Los
proyectos se agrupan en carpetas. Los siguientes tipos de
proyectos est&aacute;n disponibles en Java Development Environment:
<ul>
<li><strong>Applet.</strong> Programa escrito en lenguaje Java
que se ejecuta en un examinador que soporte Java, como HotJava.
<li><strong>Programa aut&oacute;nomo.</strong> Programa escrito en lenguaje
Java que se ejecuta fuera del examinador de Web, normalmente desde
una ventana de MS-DOS o una herramienta del shell en el entorno operativo UNIX.
<li><strong>Paquete Java.</strong> Grupo de clases Java declarado con
el mismo nombre de paquete.
<li><strong>Java Beans.</strong> Componentes de software
reutilizables que pueden utilizarse en el constructor de GUI.
</ul>

<dt><img src="../../../../images/24/vj_attributes_up.gif" align=MIDDLE><img
src="../../images/spacer2_t.gif"><strong>Atributos</strong>
<dd>Edita propiedades de componentes de la interfaz en proyectos del
constructor de GUI.
<dt><img src="../../../../images/24/tb-help_u.gif" align=MIDDLE><img
src="../../images/spacer2_t.gif"><strong>Ayuda</strong>
<dd>Proporciona informaci&oacute;n acerca de Java Development Environment. Puede obtener
ayuda de varias formas diferentes:
<ul>
<li>Pulsando en el bot&oacute;n "Ayuda" (el signo de interrogaci&oacute;n) en la barra de
herramientas principal de Java Development Environment para obtener informaci&oacute;n
acerca de los botones de la barra de herramientas principal.
<li>Pulsando en el bot&oacute;n "Ayuda" (el signo de interrogaci&oacute;n) en la barra de
herramientas principal de edici&oacute;n/depuraci&oacute;n para obtener
informaci&oacute;n acerca de los botones de la barra de herramientas de
edici&oacute;n/depuraci&oacute;n.
<li>En el men&uacute; "Ayuda", seleccionando un elemento para el que desee ayuda.
<li>En un cuadro de di&aacute;logo o pesta&ntilde;a, pulsando en el bot&oacute;n "Ayuda".
</ul>
<p>
Si no est&aacute; seguro de qu&eacute; acci&oacute;n realiza un bot&oacute;n, puede obtener una
descripci&oacute;n del bot&oacute;n colocando el puntero encima de &eacute;ste. La
descripci&oacute;n aparece en el pie del examinador.
</dl>

<p>
<IMG SRC="../../images/hg_see.gif"><strong>V&eacute;ase tambi&eacute;n:</strong>
<dl>
<dd><a href="flow.html">Fases del desarrollo de proyectos</a>
<dd><a href="terminology.html">Terminolog&iacute;a de Java Development Environment
</a> <p>
</BODY>
</HTML>
