<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!--       
 *        Copyright (C) 1997  Sun Microsystems, Inc
 *                    All rights reserved.
 *          Notice of copyright on this source code 
 *          product does not indicate publication. 
 * 
 * RESTRICTED RIGHTS LEGEND: Use, duplication, or disclosure by 
 * the U.S. Government is subject to restrictions as set forth 
 * in subparagraph (c)(1)(ii) of the Rights in Technical Data
 * and Computer Software Clause at DFARS 252.227-7013 (Oct. 1988) 
 * and FAR 52.227-19 (c) (June 1987).
 *
 *    Sun Microsystems, Inc., 2550 Garcia Avenue,
 *    Mountain View, California 94043.
 *
-->
<HTML>
<HEAD>
<TITLE>
Didacticiel de Java Workshop
</TITLE>
</HEAD>
<BODY BGCOLOR="ffffff">

<H1>Didacticiel de Java Workshop</h1>

L'objectif des didacticiels est de vous pr&eacute;senter les fonctionnalit&eacute;s essentielles de
Java Development Environment qui vous permettront de cr&eacute;er, &eacute;diter, construire, d&eacute;boguer et ex&eacute;cuter un projet.
<p>
La premi&egrave;re section vous aidera &agrave; vous familiariser avec les concepts, outils, et processus de
d&eacute;veloppement utilis&eacute;s dans Java Development Environment. Vous d&eacute;couvrirez les fonctionnalit&eacute;s
&eacute;l&eacute;mentaires de Java Development Environment au cours des cinq premiers didacticiels. Les didacticiels sept et
huit sont consacr&eacute;s aux fonctions avanc&eacute;es de Java Development Environment.
<ul>
<li><a href="overview.html">Pr&eacute;sentation de Java Development Environment</a> traite du processus d'utilisation
de Java Development Environment pour cr&eacute;er des applications Internet et des pages web.
<li><a href="quickstart.html">Didacticiel Un : Cr&eacute;ation du projet Blink</a> vous
pr&eacute;sente les fonctions &eacute;l&eacute;mentaires de cr&eacute;ation, g&eacute;n&eacute;ration et ex&eacute;cution d'une
appliquette dans Java Development Environment.
<li><a href="edit.html">Didacticiel Deux : Edition des attributs du projet</a>  vous guide
dans l'&eacute;dition des caract&eacute;ristiques d'un projet.
<li><a href="errors.html">Didacticiel Trois : Correction des erreurs dans le code source </a>
d&eacute;crit comment corriger les erreurs au cours de la g&eacute;n&eacute;ration et comment
r&eacute;g&eacute;n&eacute;rer le projet.
<li><a href="browse.html">Didacticiel Quatre : Exploration d'un projet</a> vous explique comment
parcourir les classes et les m&eacute;thodes qui composent votre projet. Vous apprendrez &eacute;galement comment
rechercher des cha&icirc;nes dans votre code source.
<li><a href="simpledebug.html">Didacticiel Cinq : D&eacute;bogage d'un projet</a>
vous explique comment localiser et corriger les bogues qui emp&ecirc;chent votre programme de
fonctionner correctement. Vous utiliserez le d&eacute;bogueur pour inspecter vos
threads, d&eacute;terminer des points d'arr&ecirc;t et examiner des expressions.
<li><a href="customize.html">Didacticiel Six: Personnalisation d'une page d'ex&eacute;cution
</a> d&eacute;crit comment &eacute;diter le fichier HTML cr&eacute;&eacute; pour vous par Java Development Environment quand vous ex&eacute;cutez un projet.
<li><a href="visual/visual.html">Didacticiel Sept : Cr&eacute;ation d'une interface graphique
utilisateur</a> explique l'assemblage d'une interface utilisateur d'un projet.
<li><a href="clock/BeansOverview.html">Didacticiel Huit : Cr&eacute;ation du projet
Clock (Horloge)
</a> d&eacute;crit la cr&eacute;ation d'un projet bean et l'importation de JavaBeans dans le
g&eacute;n&eacute;rateur d'interface.
</ul>
<p>
</BODY>
</HTML>
